###############################################################
#  Generated by:      Cadence Innovus 17.12-s095_1
#  OS:                Linux x86_64(Host ID cadence6)
#  Generated on:      Wed Nov  8 13:00:09 2023
#  Design:            alu
#  Command:           saveDesign top_post_route_and_filler
###############################################################
current_design alu
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
set_wire_load_mode enclosed
set_dont_use  [get_lib_cells {tsl18fs120_scl_ss/bh01d1}]
set_dont_use  [get_lib_cells {tsl18fs120_scl_ss/slbhb2}]
set_dont_use  [get_lib_cells {tsl18fs120_scl_ss/adiode}]
set_dont_use  [get_lib_cells {tsl18fs120_scl_ss/slbhb1}]
set_dont_use  [get_lib_cells {tsl18fs120_scl_ss/cload1}]
set_dont_use  [get_lib_cells {tsl18fs120_scl_ss/slbhb4}]
